Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: Returns a Boolean value indicating whether the sequence precedes another sequence in a lexicographical (dictionary) ordering, using the less-than operator (<) to compare elements.
ja: そのシーケンスが別のシーケンスの前に来るかどうかを、ある語彙筆記的順序（字典）順序において、より小さい演算子（<）を使って要素を比較して、指し示すブール値を返します。

source: Returns a Boolean value indicating whether the two objects are not equivalent.
ja: あるブール値を返します、それは２つのオブジェクトが等しくないかどうかを指し示します。

source: Returns a Boolean value indicating whether the value of the first argument is greater than or equal to that of the second argument.
ja: 最初の引数の値が２番目の引数のそれより大きいまたは等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the value of the first argument is greater than that of the second argument.
ja: 最初の引数の値が２番目の引数のそれより大きいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the value of the first argument is less than or equal to that of the second argument.
ja: 最初の引数の値が２番目の引数のそれより少ないまたは等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the value of the first argument is less than that of the second argument.
ja: 最初の引数の値が２番目の引数のそれより少ないかどうかを指し示しているブール値を返します。

source: Returns a Boolean value indicating whether this sequence and another sequence contain equivalent elements in the same order, using the given predicate as the equivalence test.
ja: このシーケンスともう一方のシーケンスが同等の要素を同じ順序で含むかどうかを、与えられた述部を同等テストとして使って、指し示しているブール値を返します。

source: Returns a Boolean value indicating whether this sequence and another sequence contain the same elements in the same order.
ja: このシーケンスともう一方のシーケンスが同じ要素を同じ順序で含むかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two values are equal.
ja: ２つの値が等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two values are not equal.
ja: ２つの値が等しくないかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two values aren’t equal.
ja: ２つの値が等しくないかどうかを指し示しているブール値を返します。

source: Returns a Boolean value that indicates whether a given element is a member of the option set.
ja: 与えられた要素がオプションセットのメンバであるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the receiver can be converted to a given encoding without loss of information.
ja: あるブール値を返します、それはレシーバがある与えられた符号化へと情報の損失なしに変換されることができるかどうかを指し示します。

source: Returns a Boolean value that indicates whether the receiver can reverse a transformation.
ja: あるブール値を返します、それはレシーバがある変換を逆にできるかどうかを指し示します。

source: Returns a Boolean value that indicates whether the set has no members in common with the given set.
ja: この集合が、与えられた集合と共通のメンバを１つも持たないかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the set is a subset of another set.
ja: この集合は別の集合の下位集合であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the set is a superset of the given set.
ja: この集合が、与えられた集合の上位集合であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the view controller contains the specified focus environment.
ja: あるブール値を返します、それはビューコントローラがこの指定されたフォーカス環境を含むかどうかを指し示します。

source: Returns a Boolean value that indicates whether this set is a strict subset of the given set.
ja: この集合は与えられた集合の狭義の下位集合であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether this set is a strict superset of the given set.
ja: この集合は与えられた集合の狭義の上位集合であるかどうかを指し示すブール値を返します。

source: Returns a DTD node representing the predefined entity declaration with the specified name.
ja: 指定された名前を持つあらかじめ定義されたエンティティ宣言を表している、あるDTDノードを返します。

source: Returns a binding to the resulting value of a given key path.
ja: 与えられたキーパスの結果値へのバインディングを返します。

source: Returns a closed range that contains both of its bounds.
ja: それの境界の両方を含む完結範囲を返します。

source: Returns a composite transition that uses a different transition for insertion versus removal.
ja: ある合成遷移を返します、それは挿入か除去かに対して異なる遷移を使います。

source: Returns a description of the receiver.
ja: レシーバのある記述を返します。

source: Returns a gesture that’s the result of mapping the given closure over the gesture.
ja: あるジェスチャを返します、それは与えられたクロージャをジェスチャ上にマップする結果です。

source: Returns a half-open range that contains its lower bound but not its upper bound.
ja: それの下側の境界は含むがそれの上側の境界はそうしない半開範囲を返します。

source: Returns a human-readable string giving the name of a given encoding.
ja: 与えられた符号化の名前を与えている、人間が読むことができる文字列を返します。

source: Returns a new option set of the elements contained in this set, in the given set, or in both.
ja: このセットの中に、与えられたセットの中に、または両方の中に、含まれる要素からなる新しいオプションセットを返します。

source: Returns a new option set with only the elements contained in both this set and the given set.
ja: このセットと与えられたセットの両方の中に含まれる要素だけを持つ新しいオプションセットを返します。

source: Returns a new option set with the elements contained in this set or in the given set, but not in both.
ja: このセットの中にまたは与えられたセットの中に、しかし両方の中にではなく、含まれる要素からなる新しいオプションセットを返します。

source: Returns a new set containing the elements of this set that do not occur in the given set.
ja: 与えられた集合の中の現れないこの集合の要素を含んでいる新しい集合を返します。

source: Returns a new shape that is a stroked copy of self with line-width defined by lineWidth and all other properties of StrokeStyle having their default values.
ja: ある新しい形状を返します、それはselfの線でなぞられたコピーです、lineWidthによって定義された線幅そしてそれらの省略時の値を持っている全ての他のStrokeStyleのプロパティそれらを備えます。

source: Returns a new shape that is a stroked copy of self, using the contents of style to define the stroke characteristics.
ja: ある新しい形状を返します、それはselfの線でなぞられたコピーです、styleの内容を使って筆致特徴を定義しています。

source: Returns a new string by applying a specified transform to the string.
ja: ある指定された変形を文字列に適用することによって新しい文字列を返します。

source: Returns a new string by concatenating the elements of the sequence, adding the given separator between each element.
ja: 各要素の間に与えられた分離子を加えて、シーケンスの要素を連結することによる新しい文字列を返します。

source: Returns a partial copy of the path.
ja: パスのある部分的コピーを返します。

source: Returns a partial range extending upward from a lower bound.
ja: 下側の境界から上方に拡張している部分的な範囲を返します。

source: Returns a partial range up to, and including, its upper bound.
ja: それの上側の境界までの、そしてそれを含む部分的な範囲を返します。

source: Returns a partial range up to, but not including, its upper bound.
ja: それの上側の境界までの、しかしそれを含んでいない、部分的な範囲を返します。

source: Returns a path constructed by applying the transform to all points of the path.
ja: この変換をこのパスの全ての点に適用することによって構築されるパスを返します。

source: Returns a path constructed by translating self by (dx, dy).
ja: selfを(dx, dy)によって変換することによって構築されるパスを返します。

source: Returns a random element of the collection, using the given generator as a source for randomness.
ja: コレクションのある無作為な要素を返します、与えられた生成子を無作為さの源として使います。

source: Returns a random element of the collection.
ja: コレクションのある無作為な要素を返します。

source: Returns a sequence of pairs (n, x), where n represents a consecutive integer starting at zero and x represents an element of the sequence.
ja: ペア (n, x) のシーケンスを返します、そこでnはゼロで開始する連続した数を表して、xはシーケンスの要素を表します。

source: Returns a string object encapsulating the receiver’s XML in canonical form.
ja: レシーバのもつXMLを正準形式においてカプセル化している文字列オブジェクトを返します。

source: Returns a stroked copy of the path using style to define how the stroked outline is created.
ja: そのパスからストローク（線分）にしたコピーを返します、styleを使ってどのようにストローク輪郭線が作成されるかを定義しています。

source: Returns a subsequence by skipping elements while predicate returns true and returning the remaining elements.
ja: predicateがtrueを返す間は要素を飛ばして残りの要素を返すことによって、ある下位シーケンスを返します。

source: Returns a subsequence containing all but the given number of initial elements.
ja: 指定された数の冒頭要素以外すべてを含んでいる下位シーケンスを返します。

source: Returns a subsequence containing all but the specified number of final elements.
ja: 指定された数の末尾要素以外すべてを含んでいる下位シーケンスを返します。

source: Returns a subsequence containing the initial elements until predicate returns false and skipping the remaining elements.
ja: predicateがfalseを返すまで冒頭の要素を含んでいて残りの要素を飛ばしている、ある下位シーケンスを返します。

source: Returns a subsequence from the specified position to the end of the collection.
ja: 指定された位置からコレクションの終わりまでの下位シーケンスを返します。

source: Returns a subsequence from the start of the collection through the specified position.
ja: コレクションの始まりから指定された位置までも含む下位シーケンスを返します。

source: Returns a subsequence from the start of the collection up to, but not including, the specified position.
ja: コレクションの始まりから指定された位置まで、しかしそれは含めない下位シーケンスを返します。

source: Returns a subsequence, up to the given maximum length, containing the final elements of the collection.
ja: 下位シーケンスを、指定された最大長まで、コレクションの末尾の要素を含めて返します。

source: Returns a subsequence, up to the specified maximum length, containing the initial elements of the collection.
ja: 下位シーケンスを、指定された最大長まで、コレクションの冒頭の要素を含めて返します。

source: Returns a transition defined between an active modifier and an identity modifier.
ja: 能動的な修飾子と恒等的な修飾子の間で定義されるある遷移を返します。

source: Returns a transition that moves the view away, towards the specified edge of the view.
ja: ビューをビューのその指定された縁から離れて、に向かって移動するある遷移を返します。

source: Returns a view presenting the elements of the collection in reverse order.
ja: コレクションの要素を逆順に表しているある見方を返します。

source: Returns a zero-terminated list of the encodings string objects support in the application’s environment.
ja: アプリケーションのもつ環境においてサポートされる符号化の文字列オブジェクトからなるゼロ終端されたリストを返します。

source: Returns an XMLDTD object representing the internal DTD associated with the receiver.
ja: あるXMLDTDオブジェクトを返します、レシーバと結びつけられた内部DTDを表しています。

source: Returns an XMLDocument object initialized with a given root element.
ja: XMLDocumentオブジェクトを返します、与えられたルート要素で初期化されます。

source: Returns an XMLElement object with a given tag identifier, or name
ja: XMLElementオブジェクトを返します、与えられたタグ識別子、または名前を持ちます。

source: Returns an XMLElement object with a single text-node child containing the specified text.
ja: XMLElementオブジェクトを返します、指定されたテキストを含んでいる単一のテキストノード子を持ちます。

source: Returns an XMLElement object with the given tag (name), attributes, and children.
ja: XMLElementオブジェクトを返します、与えられたタグ（名前）、属性、そして子を持ちます。

source: Returns an NSData object containing a representation of the receiver encoded using a given encoding.
ja: あるNSDataオブジェクトを返します、与えられた符号化を使って符号化されるレシーバの表現を含んでいます。

source: Returns an NSScanner object initialized to scan a given string.
ja: あるNSScannerオブジェクトを返します、ある与えられた文字列を走査するよう初期化されます。

source: Returns an NSScanner object that scans a given string according to the user’s default locale.
ja: あるNSScannerオブジェクトを返します、それは与えられた文字列をユーザのもつ省略時のロケールにより走査します。

source: Returns an NSXMLDTDNode object initialized with the DTD declaration in a given string.
ja: 与えられた文字列の中のDTD宣言で初期化されたNSXMLDTDNodeオブジェクトを返します。

source: Returns an NSXMLDocument object initialized with a single child, the root element.
ja: あるNSXMLDocumentオブジェクトを返します、単一の子、ルート要素で初期化されます。

source: Returns an NSXMLElement object created from a specified string containing XML markup.
ja: あるNSXMLElementオブジェクトを返します、XMLマークアップを含んでいるある指定された文字列から作成されます。

source: Returns an NSXMLElement object initialized with a specified name and a single text-node child containing a specified value.
ja: あるNSXMLElementオブジェクトを返します、指定された名前と単一のテキストノード子で指定値を含むもので初期化されます。

source: Returns an NSXMLElement object initialized with the specified name and URI.
ja: あるNSXMLElementオブジェクトを返します、指定された名前とURIで初期化されます。

source: Returns an NSXMLElement object initialized with the specified name.
ja: あるNSXMLElementオブジェクトを返します、指定された名前で初期化されます。

source: Returns an NSXMLNode instance initialized with the constant indicating node kind and one or more initialization options.
ja: NSXMLNodeインスタンスを返します、ノード種類を指し示している定数そして１つ以上の初期化オプションで初期化されます。

source: Returns an NSXMLNode instance initialized with the constant indicating node kind.
ja: NSXMLNodeインスタンスを返します、ノード種類を指し示している定数で初期化されます。

source: Returns an NSXMLNode object representing a namespace with a specified name and URI.
ja: NSXMLNodeオブジェクトを返します、指定された名前とURIを持つ名前空間を表しています。

source: Returns an NSXMLNode object representing a processing instruction with a specified name and value.
ja: NSXMLNodeオブジェクトを返します、指定された名前と値を持つ処理命令を表しています。

source: Returns an NSXMLNode object representing a text node with specified content.
ja: NSXMLNodeオブジェクトを返します、指定された内容を持つテキストノードを表しています。

source: Returns an NSXMLNode object representing an attribute node with a given name and string.
ja: NSXMLNodeオブジェクトを返します、与えられた名前と文字列を持つ属性ノードを表しています。

source: Returns an NSXMLNode object representing an attribute node with a given qualified name and string.
ja: NSXMLNodeオブジェクトを返します、与えられた修飾名と文字列を持つ属性ノードを表しています。

source: Returns an NSXMLNode object representing one of the predefined namespaces with the specified prefix.
ja: NSXMLNodeオブジェクトを返します、指定された接頭辞を持つあらかじめ定義された名前空間の１つを表しています。

source: Returns an XMLNode object representing a comment node containing given text.
ja: XMLNodeオブジェクトを返します、与えられたテキストを含んでいるコメントノードを表しています。

source: Returns an anchor source rect defined by r in the current view.
ja: 現在のビューにおいてrによって定義されたアンカーソース矩形を返します。

source: Returns an animation that has its speed multiplied by speed.
ja: それの速度にspeedを掛けられるあるアニメーションを返します。

source: Returns an array containing the concatenated results of calling the given transformation with each element of this sequence.
ja: 指定された変換をこのシーケンスの各要素で呼び出す結果を連結したものを含んでいる配列を返します。

source: Returns an array containing the non-nil results of calling the given transformation with each element of this sequence.
ja: 指定された変換をこのシーケンスの各要素で呼び出す結果で非-nilのものを含んでいる配列を返します。

source: Returns an array containing the results of mapping the given closure over the sequence’s elements.
ja: シーケンスの要素全体にわたって与えられたクロージャをマップする結果を含んでいる配列を返します。

source: Returns an array containing, in order, the elements of the sequence that satisfy the given predicate.
ja: 指定された述部を満足させるものであるシーケンスの要素を、順序通りに、含んでいる配列を返します。

source: Returns an array of all the registered value transformers.
ja: 全ての登録された値変換子からなる配列を返します。

source: Returns an effect that produces the same geometry transform as this view, and only applies the transform while rendering its view.
ja: ある効果を返します、それはこのビューと同じ幾何学的変換を生み出します、そしてその変換をそれのビューを描出している間に適用するだけです。

source: Returns an element whose fully qualified name is specified.
ja: それの完全修飾名が指定されるある要素を返します。

source: Returns an empty document node.
ja: ある空の書類ノードを返します。

source: Returns an immutable array containing the child nodes of the receiver (as NSXMLNode objects).
ja: ある不変の配列を返します、レシーバの子ノードを含んでいます（NSXMLNodeオブジェクトとして）。

source: Returns an index that is the specified distance from the given index, unless that distance is beyond a given limiting index.
ja: 与えられたインデックスから指定された隔たりのインデックスを返します、その隔たりが与えられた限界インデックスを超えない限りは。

source: Returns an index that is the specified distance from the given index.
ja: 与えられたインデックスから指定された隔たりのインデックスを返します。

source: Returns an initialized NSTask object with the environment of the current process.
ja: 初期化されたNSTaskオブジェクトを返します、現在のプロセスの環境を持ちます。

source: Returns an iterator over the elements of the collection.
ja: コレクションの要素すべてを対象としたイテレータを返します。

source: Returns any user info provider specified for a given error domain.
ja: 与えられたエラードメインに対して指定された何らかのユーザ情報プロバイダーを返します。

source: Returns the XMLDocument object containing the root element and representing the XML document as a whole.
ja: XMLDocumentオブジェクトを返します、ルート要素を含んでいます、そしてXML書類を全体として表しています。

source: Returns the C-string encoding assumed for any method accepting a C string as an argument.
ja: C文字列を引数として受け入れる何らかのメソッドのために仮定されるC文字列符号化を返します。

source: Returns the DTD node representing an attribute-list declaration for a given attribute and its element.
ja: 与えられた属性とそれの要素に対して、属性リスト宣言を表しているDTDノードを返します。

source: Returns the DTD node representing an element declaration for a specified element.
ja: 指定された要素に対する要素宣言を表しているDTDノードを返します。

source: Returns the DTD node representing the entity declaration for a specified entity.
ja: 指定されたエンティティに対するエンティティ宣言を表しているDTDノードを返します。

source: Returns the DTD node representing the notation declaration identified by the specified notation name.
ja: 指定された表記法名によって識別される表記法宣言を表しているDTDノードを返します。

source: Returns the MIME type for the receiver.
ja: レシーバに対するMIME型を返します。

source: Returns the URI associated with the receiver.
ja: レシーバと結びつけられたURIを返します。

source: Returns the XML string representation of the receiver—that is, the entire document—encapsulated in a data object.
ja: レシーバのXML文字列表現を返します — すなわち、書類全体 — データオブジェクトの中にカプセル化されます。

source: Returns the XPath expression identifying the receiver’s location in the document tree.
ja: 書類ツリーにおいてレシーバのもつ位置を識別しているXPath表現を返します。

source: Returns the attribute node of the receiver that is identified by a local name and URI.
ja: あるローカル名とURIによって識別されるレシーバの属性ノードを返します。

source: Returns the attribute node of the receiver with the specified name.
ja: 指定された名前を持つ、レシーバの属性ノードを返します。

source: Returns the child element nodes (as NSXMLElement objects) of the receiver that are matched with the specified local name and URI.
ja: レシーバの子要素ノードそれらを返します（NSXMLElementオブジェクトとして）、それらは指定されたローカル名とURIに一致するものです。

source: Returns the child element nodes (as NSXMLElement objects) of the receiver that have a specified name.
ja: レシーバの子要素ノードそれらを返します（NSXMLElementオブジェクトとして）、それらは指定された名前を持ちます。

source: Returns the child node of the receiver at the specified location.
ja: 指定された位置での、レシーバの子ノードを返します。

source: Returns the class of the value returned by the receiver for a forward transformation.
ja: レシーバによって返される値のクラスを前方変換のために返します。

source: Returns the concatenated elements of this sequence of sequences, inserting the given separator between each element.
ja: 各要素の間に与えられた分離子を挿入して、これらシーケンスに属するシーケンスの要素それらを鎖状に連結して返します。

source: Returns the container view’s bounds rectangle, converted to a defined coordinate space.
ja: コンテナビューのもつ境界矩形を返します、ある定義された座標空間に変換されます。

source: Returns the content of the receiver as a string value.
ja: レシーバの内容を文字列値として返します。

source: Returns the current body of self.
ja: selfの現在のボディを返します。

source: Returns the current value of the effect.
ja: その効果の現在の値を返します。

source: Returns the difference needed to produce this collection’s ordered elements from the given collection, using the given predicate as an equivalence test.
ja: このコレクションのもつ順序付けられた要素をこの与えられたコレクションから生み出すために必要とされる差異を返します、与えられた述部を同等性試験として使います。

source: Returns the difference needed to produce this collection’s ordered elements from the given collection.
ja: このコレクションのもつ順番付き要素をこの与えられたコレクションから生成するのに必要な差異を返します。

source: Returns the display name for the given locale component value.
ja: 与えられたロケール構成要素値に対する表示名を返します。

source: Returns the distance between two indices.
ja: ２つのインデックス間の隔たりを返します。

source: Returns the dot-product of this animatable data instance with itself.
ja: このアニメーション可能データインスタンスとそれ自身のドット積を返します。

source: Returns the dot-product of this animated pair with itself.
ja: このアニメーション化ペアとそれ自身とのドット積を返します。

source: Returns the dot-product of this vector arithmetic instance with itself.
ja: このベクトル演算インスタンスとそれ自身のドット積を返します。

source: Returns the elements of the sequence, shuffled using the given generator as a source for randomness.
ja: シーケンスの要素を返します、与えられた生成子を無作為さの源として使ってシャッフルされます。

source: Returns the elements of the sequence, shuffled.
ja: シーケンスの要素を、シャッフルして返します。

source: Returns the elements of the sequence, sorted using the given predicate as the comparison between elements.
ja: 与えられた述部を要素間の比較として使ってソートされた、シーケンスの要素を返します。

source: Returns the elements of the sequence, sorted.
ja: シーケンスの要素を、ソートして返します。

source: Returns the elements of this sequence of sequences, concatenated.
ja: 複数のシーケンスの中のこのシーケンスの要素を、連結して返します。

source: Returns the exit status returned by the receiver’s executable.
ja: レシーバのもつ実行可能ファイルによって返される退出状態を返します。

source: Returns the first element of the sequence that satisfies the given predicate.
ja: 与えられた述部を満たすこのシーケンスの最初の要素を返します。

source: Returns the first index in which an element of the collection satisfies the given predicate.
ja: 最初のインデックスで、それにおけるコレクションの要素が与えられた述部を満足させるものを返します。

source: Returns the first index where the specified value appears in the collection.
ja: 指定された値がコレクションにおいて現れるところの最初のインデックスを返します。

source: Returns the given number unchanged.
ja: 与えられた数を変更せずに返します。

source: Returns the index of the last element in the collection that matches the given predicate.
ja: 与えられたに合致する、コレクションの中の最後の要素のインデックスを返します。

source: Returns the index of the receiver identifying its position relative to its sibling nodes.
ja: レシーバのインデックスを返します、それの位置をそれの親類ノードに相対的に識別しています。

source: Returns the kind of node the receiver is as a constant of type XMLNode.Kind.
ja: ノードの種類を返します、レシーバは型XMLNode.Kindのある定数と同じものです。

source: Returns the last element of the sequence that satisfies the given predicate.
ja: 与えられた述部を満たすこのシーケンスの最後の要素を返します。

source: Returns the last index where the specified value appears in the collection.
ja: 指定された値がコレクションにおいて現れるところの最後のインデックスを返します。

source: Returns the local name from the specified qualified name.
ja: 指定された修飾名からローカル名を返します。

source: Returns the local name of the receiver.
ja: レシーバのローカル名を返します。

source: Returns the longest possible subsequences of the collection, in order, around elements equal to the given element.
ja: 与えられた要素と等しい要素を避けるようにして、このコレクションの最も長くなりうる下位シーケンスを、順番に返します。

source: Returns the longest possible subsequences of the collection, in order, that don’t contain elements satisfying the given predicate.
ja: 与えられた述部を満たす要素を含んでいない、このコレクションの最も長くなりうる下位シーケンスそれらを順序どおりに返します。

source: Returns the longest possible subsequences of the sequence, in order, around elements equal to the given element.
ja: 与えられた要素と等しい要素を避けるようにして、このシーケンスの最も長くなりうる下位シーケンスを、順番に返します。

source: Returns the maximum element in the sequence, using the given predicate as the comparison between elements.
ja: シーケンスの中の最大の要素を返します、与えられた述部を要素間の比較として使います。

source: Returns the maximum element in the sequence.
ja: シーケンスの中の最大の要素を返します。

source: Returns the minimum element in the sequence, using the given predicate as the comparison between elements.
ja: シーケンスの中の最小の要素を返します、与えられた述部を要素間の比較として使います。

source: Returns the minimum element in the sequence.
ja: シーケンスの中の最小の要素を返します。

source: Returns the name of the notation associated with the receiver.
ja: レシーバと結び付けられた表記法の名前を返します。

source: Returns the name of the receiver.
ja: レシーバの名前を返します。

source: Returns the namespace node with a specified prefix.
ja: 指定された接頭辞を持つ名前空間ノードを返します。

source: Returns the namespace node with the prefix matching the given qualified name.
ja: 与えられた修飾名と一致する接頭辞を持つ名前空間ノードを返します。

source: Returns the nesting level of the receiver within the tree hierarchy.
ja: ツリー階層内でのレシーバの入れ子水準を返します。

source: Returns the next NSXMLNode object in document order.
ja: 書類順で次のNSXMLNodeオブジェクトを返します。

source: Returns the next NSXMLNode object that is a sibling node to the receiver.
ja: 次のNSXMLNodeオブジェクトを返します、それはレシーバに対する親類ノードです。

source: Returns the nodes resulting from executing an XPath query upon the receiver.
ja: XPathクエリをレシーバ上で遂行する結果としてのノードを返します。

source: Returns the number of child nodes the receiver has.
ja: レシーバが持つ子ノードの数を返します。

source: Returns the object value of the receiver.
ja: レシーバのオブジェクト値を返します。

source: Returns the objects resulting from executing an XQuery query upon the receiver.
ja: XQueryクエリをレシーバ上で遂行する結果としてのオブジェクトを返します。

source: Returns the parent node of the receiver.
ja: レシーバの親ノードを返します。

source: Returns the position immediately after the given index.
ja: 与えられたインデックスの直後の位置を返します。

source: Returns the prefix associated with the specified URI.
ja: 指定されたURIと結びつけられた接頭辞を返します。

source: Returns the prefix from the specified qualified name.
ja: 指定された修飾名から接頭辞を返します。

source: Returns the prefix of the receiver’s name.
ja: レシーバのもつ名前の接頭辞を返します。

source: Returns the previous NSXMLNode object in document order.
ja: 書類順で前のNSXMLNodeオブジェクトを返します。

source: Returns the previous NSXMLNode object that is a sibling node to the receiver.
ja: 前のNSXMLNodeオブジェクトを返します、それはレシーバに対する親類ノードです。

source: Returns the public identifier associated with the receiver.
ja: レシーバと結び付けられたパブリック識別子を返します。

source: Returns the reason the task was terminated.
ja: タスクが終わらされた理由を返します。

source: Returns the receiver’s DTD kind.
ja: レシーバの持つDTD種類を返します。

source: Returns the receiver’s process identifier.
ja: レシーバのもつプロセス識別子を返します。

source: Returns the receiver’s public identifier.
ja: レシーバのもつパブリック識別子を返します。

source: Returns the receiver’s system identifier.
ja: レシーバのもつシステム識別子を返します。
